import streamlit as st

st.set_page_config(
    layout="wide",
    initial_sidebar_state="expanded"
)

# Текст ниже сгенерирован LLM
st.title('👋 Hello')
st.write("Добро пожаловать в приложение для анализа погодных условий и выявления аномалий!")
st.markdown("---")

st.subheader('📌 О приложении')
st.write("""
Это приложение позволяет:
- Провести исторический анализ температурных данных
- Провести мониторинг текущих погодных условий в выбранном городе
- Выявить аномалии в температурных данных
- Кластеризировать города по температурным данным с помощью KMeans
""")

# Ссылка на GitHub
with st.sidebar:
    st.markdown("---")
    st.markdown("**👩‍💻 Автор:** Сморчкова Юлиана")
    st.markdown("**🔗 Подробнее на** [GitHub](https://github.com/smorchkova001-git/weather-analysis-dashboard)")
    st.markdown("---")